{"failureDetails":
  {
    "accessMethodDoesNotExist":"You tried to modify or remove an accessMethod using an ID that did not correspond to a valid access method.",
    "callBrandingProfileDoesNotExist":"You tried to modify or remove a call branding profile using an ID that did not correspond to a valid call branding profile.",
    "callBridgeDoesNotExist":"You tried to modify or remove a configured clustered Call Bridge using an ID that did not correspond to a valid clustered Call Bridge.",
    "callBridgeGroupDoesNotExist":"You tried to modify, remove or use a Call Bridge group using an ID that did not correspond to a valid Call Bridge group (from version 2.1).",
    "callBridgeGroupUnavailable":"You tried to create a participant on a Call Bridge Group that is unavail- able or could not accept the call (from version 2.2).",
    "callBridgeUnavailable":"You tried to create a participant on a Call Bridge that is unavailable or could not accept the call (from version 2.2).",
    "callDoesNotExist":"You tried to perform a method on a call object using an ID that did not correspond to a currently active call.",
    "callRecordingCannotBeModified":"You tried to start/stop recording a call that cannot be modified.",
    "callStreamingCannotBeModified":"You tried to start/stop streaming a call that cannot be modified (from version 2.1).",
    "callLegCannotBeDeleted":"You tried to delete a call leg that can't be deleted.",
    "callLegDoesNotExist":"You tried to perform a method on a call leg object using an ID that did not correspond to a currently active call leg.",
    "callLegProfileDoesNotExist":"You tried to modify or remove a callLegProfile using an ID that did not correspond to a valid call leg profile.",
    "callProfileDoesNotExist":"You tried to modify or remove a callProfile using an ID that is not valid.",
    "cdrReceiverDoesNotExist":"You tried to modify or remove a CDR receiver using an ID that did not correspond to a valid CDR receiver.",
    "coSpaceDoesNotExist":"You tried to modify or remove a coSpace using an ID that did not correspond to a valid coSpace on the system",
    "coSpaceUserDoesNotExist":"You tried to modify or remove a coSpace user using an ID that did not correspond to a valid coSpace user.",
    "databaseNotReady":"You tried a method (e.g. initiation of an LDAP sync method) before the database was ready",
    "directorySearchLocationDoesNotExist":"You tried to reference, modify or remove a directory search location using an ID that did not correspond to a valid directory search location.",
    "dtmfProfileDoesNotExist":"You tried to reference, modify or remove a DTMF profile using an ID that did not correspond to a valid DTMF profile.",
    "duplicateCallBridgeName":"You tried to create or modify a clustered Call Bridge to use a name that would clash with an existing configured clustered Call Bridge.",
    "duplicateCoSpaceId":"You tried to create or modify a coSpace call ID to use a call ID that clashed with one used by another coSpace.",
    "duplicateCoSpaceUri":"You tried to create or modify a coSpace to use a URI that clashed with one that corresponds to another coSpace. (Two coSpaces can't share the same URI, because the Meeting Server must be able to uniquely resolve an incoming call to a coSpace URI).",
    "duplicateCoSpaceIdPasscode":"You tried to modify a coSpace, or create or modify a coSpace access method, using a call ID/passcode combination that clashed with another call ID/passcode that is already used by that coSpace or one of its access methods.",
    "duplicateCoSpaceUriPasscode":"You tried to modify a coSpace, or create or modify a coSpace access method, using a URI/passcode combination that clashed with URI/passcode combination that is already used by that coSpace or one of its access methods.",
    "duplicateCoSpaceSecret":"You tried to modify a coSpace, or create or modify a coSpace access method, using a secret that clashed with one that is already used by that coSpace or one of its access methods.",
    "forwardingDialPlanRuleDoesNotExist":"You tried to modify or remove an forwarding dial plan rule using an ID that did not correspond to a valid forwarding dial plan rule.",
    "inboundDialPlanRuleDoesNotExist":"You tried to modify or remove an inbound dial plan rule using an ID that did not correspond to a valid inbound dial plan rule.",
    "inboundDialPlanRuleUriConflict":"You tried to make modifications to an inbound dial plan rule which would have caused a URI conflict. For example, this can  happen if you try to add  a rule which matches multiple tenants and more than  one tenant has a coSpace with the same URI.",
    "invalidOperation":"You tried an operation which isn't supported; for example, you attempted to POST to /api/v1/system/profiles or issue a DELETE for a configured user generated from an LDAP sync.",
    "invalidVersion":"You attempted an operation with an invalid API version.",
    "ivrBrandingProfileDoesNotExist":"You tried to modify or remove an IVR branding profile object using an ID that did not correspond to a valid IVR branding profile on the system.",
    "ivrDoesNotExist":"You tried to modify or remove an IVR object using an ID that did not correspond to a valid IVR on the system.",
    "ivrUriConflict":"You tried to make modifications to an IVR object which would have caused a URI conflict.",
    "ldapMappingDoesNotExist":"You tried to modify or remove an LDAP mapping using an ID that did not correspond to a valid LDAP mapping.",
    "ldapServerDoesNotExist":"You tried to modify or remove an LDAP server using an ID that did not correspond to a valid LDAP server.",
    "ldapSourceDoesNotExist":"You tried to modify or remove an LDAP source using an ID that did not correspond to a valid LDAP source.",
    "ldapSyncCannotBeCancelled":"You tried to cancel an LDAP synchronization that has either started or completed - only LDAP synchronization methods that have not started yet can be canceled.",
    "ldapSyncDoesNotExist":"You tried to query or cancel an LDAP synchronization with an ID that did not correspond to a valid LDAP synchronization.",
    "loadBalancingDisabled":"You tried to create a participant in a Call Bridge Group with load balancing for outgoing calls disabled (from version 2.2).",
    "messageDoesNotExist":"You tried to remove a coSpace message using an ID that did not correspond to a valid coSpace message.",
    "outboundDialPlanRuleDoesNotExist":"You tried to modify or remove an outbound dial plan rule using an ID that did not correspond to a valid outbound dial plan rule",
    "parameterError":"One or more parameters in a request were found  to be invalid. Supporting parameter and error values give more detail about the failure.",
    "participantCannotBeDeleted":"",
    "participantCannotBeModified":"",
    "participantLimitReached":"You tried to add  a new participant beyond the maximum number allowed for the call.",
    "recorderDoesNotExist":"You tried to modify or remove a recorder using an ID that did not correspond to a valid recorder.",
    "recordingLimitReached":"You tried to start recording a call beyond the maximum number allowed.",
    "streamerDoesNotExist":"You tried to modify or remove a streamer using an ID that did not correspond to a valid streamer (from version 2.1).",
    "streamingLimitReached":"You tried to start streaming a call beyond the maximum number allowed (from version 2.1).",
    "tenantDoesNotExist":"You tried to modify or remove a tenant using an ID that did not correspond to a valid tenant",
    "tenantGroupCoSpaceIdConflict":"Your request to remove or use a tenant group would have resulted in a coSpace ID conflict.",
    "tenantGroupDoesNotExist":"You tried to modify, remove or use a tenant group that does not exist.",
    "tenantParticipantLimitReached":"You tried to add  a new participant beyond the maximum number allowed for the owning tenant.",
    "tooManyCdrReceivers":"You tried to add  a new CDR receiver when the maximum number were already present. Currently, up to 2 CDR receivers are supported.",
    "tooManyLdapSyncs":"A method to create a new LDAP synchronization method failed. Try again later.",
    "unrecognisedObject":"There are elements in the URI you are accessing that are not recognized; for example, you tried to perform a GET on /api/v1/system/profile rather than  (the correct) /api/v1/system/profiles",
    "userDoesNotExist":"You tried to modify or remove a user using an ID that did not correspond to a valid user.",
    "userProfileDoesNotExist":"You tried to modify a user profile using an ID that did not correspond to a valid user profile."
  }
}
